Ferapont/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <predefined>
    <items>
      <name>Ферапонт</name>
      <description>Ферапонт</description>
    </items>
    <items>
      <name>ЭтотПользователь</name>
      <description>Этот пользователь</description>
    </items>
  </predefined>
  <attributes>
    <name>Telegram</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Никнейм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешилПисатьVK</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеНастройки</name>
    <type>
      <types>CatalogRef.ПерсональныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_БотОстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Ferapont/src/InformationRegisters/ДневнойПрогресс/ДневнойПрогресс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДневнойПрогресс</name>
  <resources>
    <name>КоличествоСлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ferapont/src/InformationRegisters/АктивныеСеансы/АктивныеСеансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивныеСеансы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Cookie</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ferapont/src/InformationRegisters/ПотоковоеЧтение/ПотоковоеЧтение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПотоковоеЧтение</name>
  <resources>
    <name>Слов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НачалоВК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Завершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимумСлов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Текст</name>
    <type>
      <types>CatalogRef.Произведения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ferapont/src/Catalogs/Пользователи/ObjectModule.bsl
#Если НаСервере Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
	
	Попытка
		
		ДН				= ДеньНедели(ТекущаяДатаСеанса());
		Набор 			= РегистрыСведений.ДневнойПрогресс.СоздатьНаборЗаписей();
		ЭлементОтбора 	= Набор.Отбор.Пользователь;	
		ДнейВНеделе		= 7;
		ЕдиницаВремени	= 60;
		ЧасовВСутках	= 24;
		
		ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
		ЭлементОтбора.Установить(Ссылка);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			
			Для Н = 0 По 6 Цикл		
				ЗаполняемыйДень = ?(ДН - Н < 1, ДН - Н + ДнейВНеделе, ДН - Н); 
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = НачалоДня(ТекущаяДатаСеанса()) - (ЕдиницаВремени * ЕдиницаВремени * ЧасовВСутках * Н);
				НоваяЗапись.День = ИнструментарийВызовСервера.ВернутьДеньНедели(ЗаполняемыйДень);
				НоваяЗапись.КоличествоСлов = 0;
				НоваяЗапись.Пользователь = Ссылка;
				Набор.Записать(Истина);
			КонецЦикла;
					
		КонецЕсли;
		
	Исключение
		
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
		
	КонецПопытки;
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)

Если ОбменДанными.Загрузка Тогда
     Возврат;
КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДневнойПрогресс.Пользователь КАК Пользователь,
		|	ДневнойПрогресс.День КАК День
		|ПОМЕСТИТЬ ДневнойПрогресс
		|ИЗ
		|	РегистрСведений.ДневнойПрогресс КАК ДневнойПрогресс
		|ГДЕ
		|	ДневнойПрогресс.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктивныеСеансы.Cookie КАК Cookie,
		|	АктивныеСеансы.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ АктивныеСеансы
		|ИЗ
		|	РегистрСведений.АктивныеСеансы КАК АктивныеСеансы
		|ГДЕ
		|	АктивныеСеансы.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотоковоеЧтение.Пользователь КАК Пользователь,
		|	ПотоковоеЧтение.Текст КАК Текст
		|ПОМЕСТИТЬ ПотоковоеЧтение
		|ИЗ
		|	РегистрСведений.ПотоковоеЧтение КАК ПотоковоеЧтение
		|ГДЕ
		|	ПотоковоеЧтение.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Ссылка);
	
	РезультатыЗапроса 	= Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	СоответствиеПакетов	= Новый Соответствие;
	Счетчик			 	= 0;
	
	СоответствиеПакетов.Вставить(0, "ДневнойПрогресс" );
	СоответствиеПакетов.Вставить(1, "АктивныеСеансы" );
	СоответствиеПакетов.Вставить(2, "ПотоковоеЧтение" );
	
	Для Каждого РезультатЗапроса Из РезультатыЗапроса Цикл
		
		ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
		ТекущийРегистр			= СоответствиеПакетов.Получить(Счетчик);
		
		Если ТекущийРегистр = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			МЗ = РегистрыСведений[ТекущийРегистр].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, ВыборкаДетальныеЗаписи);
			МЗ.Удалить();
			
		КонецЦикла;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ПерсональныеНастройки КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь ";
	
	Запрос.УстановитьПараметр("Пользователь", Ссылка);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	МассивСсылок		= Новый Массив;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	УдалитьОбъекты(МассивСсылок);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
